MikroElektronika/core_packages/PIC/XC8/def/PIC16F19186/mcu.h
// Register: SMT1CPR
#define SMT1CPR SMT1CPR
#ifndef __CCI__
extern volatile __uint24                SMT1CPR             __at(0x48F);
#endif
#ifndef _LIB_BUILD
asm("SMT1CPR equ 048Fh");
#endif

// Register: SMT1CPRL
#define SMT1CPRL SMT1CPRL
extern volatile unsigned char           SMT1CPRL            __at(0x48F);
#ifndef _LIB_BUILD
asm("SMT1CPRL equ 048Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CPR                    :8;
    };
    struct {
        unsigned CPR0                   :1;
        unsigned CPR1                   :1;
        unsigned CPR2                   :1;
        unsigned CPR3                   :1;
        unsigned CPR4                   :1;
        unsigned CPR5                   :1;
        unsigned CPR6                   :1;
        unsigned CPR7                   :1;
    };
    struct {
        unsigned SMT1CPR                :8;
    };
} SMT1CPRLbits_t;
extern volatile SMT1CPRLbits_t SMT1CPRLbits __at(0x48F);
// bitfield macros
#define _SMT1CPRL_CPR_POSN                                  0x0
#define _SMT1CPRL_CPR_POSITION                              0x0
#define _SMT1CPRL_CPR_SIZE                                  0x8
#define _SMT1CPRL_CPR_LENGTH                                0x8
#define _SMT1CPRL_CPR_MASK                                  0xFF
#define _SMT1CPRL_CPR0_POSN                                 0x0
#define _SMT1CPRL_CPR0_POSITION                             0x0
#define _SMT1CPRL_CPR0_SIZE                                 0x1
#define _SMT1CPRL_CPR0_LENGTH                               0x1
#define _SMT1CPRL_CPR0_MASK                                 0x1
#define _SMT1CPRL_CPR1_POSN                                 0x1
#define _SMT1CPRL_CPR1_POSITION                             0x1
#define _SMT1CPRL_CPR1_SIZE                                 0x1
#define _SMT1CPRL_CPR1_LENGTH                               0x1
#define _SMT1CPRL_CPR1_MASK                                 0x2
#define _SMT1CPRL_CPR2_POSN                                 0x2
#define _SMT1CPRL_CPR2_POSITION                             0x2
#define _SMT1CPRL_CPR2_SIZE                                 0x1
#define _SMT1CPRL_CPR2_LENGTH                               0x1
#define _SMT1CPRL_CPR2_MASK                                 0x4
#define _SMT1CPRL_CPR3_POSN                                 0x3
#define _SMT1CPRL_CPR3_POSITION                             0x3
#define _SMT1CPRL_CPR3_SIZE                                 0x1
#define _SMT1CPRL_CPR3_LENGTH                               0x1
#define _SMT1CPRL_CPR3_MASK                                 0x8
#define _SMT1CPRL_CPR4_POSN                                 0x4
#define _SMT1CPRL_CPR4_POSITION                             0x4
#define _SMT1CPRL_CPR4_SIZE                                 0x1
#define _SMT1CPRL_CPR4_LENGTH                               0x1
#define _SMT1CPRL_CPR4_MASK                                 0x10
#define _SMT1CPRL_CPR5_POSN                                 0x5
#define _SMT1CPRL_CPR5_POSITION                             0x5
#define _SMT1CPRL_CPR5_SIZE                                 0x1
#define _SMT1CPRL_CPR5_LENGTH                               0x1
#define _SMT1CPRL_CPR5_MASK                                 0x20
#define _SMT1CPRL_CPR6_POSN                                 0x6
#define _SMT1CPRL_CPR6_POSITION                             0x6
#define _SMT1CPRL_CPR6_SIZE                                 0x1
#define _SMT1CPRL_CPR6_LENGTH                               0x1
#define _SMT1CPRL_CPR6_MASK                                 0x40
#define _SMT1CPRL_CPR7_POSN                                 0x7
#define _SMT1CPRL_CPR7_POSITION                             0x7
#define _SMT1CPRL_CPR7_SIZE                                 0x1
#define _SMT1CPRL_CPR7_LENGTH                               0x1
#define _SMT1CPRL_CPR7_MASK                                 0x80
#define _SMT1CPRL_SMT1CPR_POSN                              0x0
#define _SMT1CPRL_SMT1CPR_POSITION                          0x0
#define _SMT1CPRL_SMT1CPR_SIZE                              0x8
#define _SMT1CPRL_SMT1CPR_LENGTH                            0x8
#define _SMT1CPRL_SMT1CPR_MASK                              0xFF

// Register: SMT1CPRH
#define SMT1CPRH SMT1CPRH
extern volatile unsigned char           SMT1CPRH            __at(0x490);
#ifndef _LIB_BUILD
asm("SMT1CPRH equ 0490h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CPR                    :8;
    };
    struct {
        unsigned CPR8                   :1;
        unsigned CPR9                   :1;
        unsigned CPR10                  :1;
        unsigned CPR11                  :1;
        unsigned CPR12                  :1;
        unsigned CPR13                  :1;
        unsigned CPR14                  :1;
        unsigned CPR15                  :1;
    };
    struct {
        unsigned SMT1CPR8               :1;
        unsigned SMT1CPR9               :1;
        unsigned SMT1CPR10              :1;
        unsigned SMT1CPR11              :1;
        unsigned SMT1CPR12              :1;
        unsigned SMT1CPR13              :1;
        unsigned SMT1CPR14              :1;
        unsigned SMT1CPR15              :1;
    };
    struct {
        unsigned SMT1CPR                :8;
    };
} SMT1CPRHbits_t;
extern volatile SMT1CPRHbits_t SMT1CPRHbits __at(0x490);
// bitfield macros
#define _SMT1CPRH_CPR_POSN                                  0x0
#define _SMT1CPRH_CPR_POSITION                              0x0
#define _SMT1CPRH_CPR_SIZE                                  0x8
#define _SMT1CPRH_CPR_LENGTH                                0x8
#define _SMT1CPRH_CPR_MASK                                  0xFF
#define _SMT1CPRH_CPR8_POSN                                 0x0
#define _SMT1CPRH_CPR8_POSITION                             0x0
#define _SMT1CPRH_CPR8_SIZE                                 0x1
#define _SMT1CPRH_CPR8_LENGTH                               0x1
#define _SMT1CPRH_CPR8_MASK                                 0x1
#define _SMT1CPRH_CPR9_POSN                                 0x1
#define _SMT1CPRH_CPR9_POSITION                             0x1
#define _SMT1CPRH_CPR9_SIZE                                 0x1
#define _SMT1CPRH_CPR9_LENGTH                               0x1
#define _SMT1CPRH_CPR9_MASK                                 0x2
#define _SMT1CPRH_CPR10_POSN                                0x2
#define _SMT1CPRH_CPR10_POSITION                            0x2
#define _SMT1CPRH_CPR10_SIZE                                0x1
#define _SMT1CPRH_CPR10_LENGTH                              0x1
#define _SMT1CPRH_CPR10_MASK                                0x4
#define _SMT1CPRH_CPR11_POSN                                0x3
#define _SMT1CPRH_CPR11_POSITION                            0x3
#define _SMT1CPRH_CPR11_SIZE                                0x1
#define _SMT1CPRH_CPR11_LENGTH                              0x1
#define _SMT1CPRH_CPR11_MASK                                0x8
#define _SMT1CPRH_CPR12_POSN                                0x4
#define _SMT1CPRH_CPR12_POSITION                            0x4
#define _SMT1CPRH_CPR12_SIZE                                0x1
#define _SMT1CPRH_CPR12_LENGTH                              0x1
#define _SMT1CPRH_CPR12_MASK                                0x10
#define _SMT1CPRH_CPR13_POSN                                0x5
#define _SMT1CPRH_CPR13_POSITION                            0x5
#define _SMT1CPRH_CPR13_SIZE                                0x1
#define _SMT1CPRH_CPR13_LENGTH                              0x1
#define _SMT1CPRH_CPR13_MASK                                0x20
#define _SMT1CPRH_CPR14_POSN                                0x6
#define _SMT1CPRH_CPR14_POSITION                            0x6
#define _SMT1CPRH_CPR14_SIZE                                0x1
#define _SMT1CPRH_CPR14_LENGTH                              0x1
#define _SMT1CPRH_CPR14_MASK                                0x40
#define _SMT1CPRH_CPR15_POSN                                0x7
#define _SMT1CPRH_CPR15_POSITION                            0x7
#define _SMT1CPRH_CPR15_SIZE                                0x1
#define _SMT1CPRH_CPR15_LENGTH                              0x1
#define _SMT1CPRH_CPR15_MASK                                0x80
#define _SMT1CPRH_SMT1CPR8_POSN                             0x0
#define _SMT1CPRH_SMT1CPR8_POSITION                         0x0
#define _SMT1CPRH_SMT1CPR8_SIZE                             0x1
#define _SMT1CPRH_SMT1CPR8_LENGTH                           0x1
#define _SMT1CPRH_SMT1CPR8_MASK                             0x1
#define _SMT1CPRH_SMT1CPR9_POSN                             0x1
#define _SMT1CPRH_SMT1CPR9_POSITION                         0x1
#define _SMT1CPRH_SMT1CPR9_SIZE                             0x1
#define _SMT1CPRH_SMT1CPR9_LENGTH                           0x1
#define _SMT1CPRH_SMT1CPR9_MASK                             0x2
#define _SMT1CPRH_SMT1CPR10_POSN                            0x2
#define _SMT1CPRH_SMT1CPR10_POSITION                        0x2
#define _SMT1CPRH_SMT1CPR10_SIZE                            0x1
#define _SMT1CPRH_SMT1CPR10_LENGTH                          0x1
#define _SMT1CPRH_SMT1CPR10_MASK                            0x4
#define _SMT1CPRH_SMT1CPR11_POSN                            0x3
#define _SMT1CPRH_SMT1CPR11_POSITION                        0x3
#define _SMT1CPRH_SMT1CPR11_SIZE                            0x1
#define _SMT1CPRH_SMT1CPR11_LENGTH                          0x1
#define _SMT1CPRH_SMT1CPR11_MASK                            0x8
#define _SMT1CPRH_SMT1CPR12_POSN                            0x4
#define _SMT1CPRH_SMT1CPR12_POSITION                        0x4
#define _SMT1CPRH_SMT1CPR12_SIZE                            0x1
#define _SMT1CPRH_SMT1CPR12_LENGTH                          0x1
#define _SMT1CPRH_SMT1CPR12_MASK                            0x10
#define _SMT1CPRH_SMT1CPR13_POSN                            0x5
#define _SMT1CPRH_SMT1CPR13_POSITION                        0x5
#define _SMT1CPRH_SMT1CPR13_SIZE                            0x1
#define _SMT1CPRH_SMT1CPR13_LENGTH                          0x1
#define _SMT1CPRH_SMT1CPR13_MASK                            0x20
#define _SMT1CPRH_SMT1CPR14_POSN                            0x6
#define _SMT1CPRH_SMT1CPR14_POSITION                        0x6
#define _SMT1CPRH_SMT1CPR14_SIZE                            0x1
#define _SMT1CPRH_SMT1CPR14_LENGTH                          0x1
#define _SMT1CPRH_SMT1CPR14_MASK                            0x40
#define _SMT1CPRH_SMT1CPR15_POSN                            0x7
#define _SMT1CPRH_SMT1CPR15_POSITION                        0x7
#define _SMT1CPRH_SMT1CPR15_SIZE                            0x1
#define _SMT1CPRH_SMT1CPR15_LENGTH                          0x1
#define _SMT1CPRH_SMT1CPR15_MASK                            0x80
#define _SMT1CPRH_SMT1CPR_POSN                              0x0
#define _SMT1CPRH_SMT1CPR_POSITION                          0x0
#define _SMT1CPRH_SMT1CPR_SIZE                              0x8
#define _SMT1CPRH_SMT1CPR_LENGTH                            0x8
#define _SMT1CPRH_SMT1CPR_MASK                              0xFF

// Register: SMT1CPRU
#define SMT1CPRU SMT1CPRU
extern volatile unsigned char           SMT1CPRU            __at(0x491);
#ifndef _LIB_BUILD
asm("SMT1CPRU equ 0491h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CPR                    :8;
    };
    struct {
        unsigned CPR16                  :1;
        unsigned CPR17                  :1;
        unsigned CPR18                  :1;
        unsigned CPR19                  :1;
        unsigned CPR20                  :1;
        unsigned CPR21                  :1;
        unsigned CPR22                  :1;
        unsigned CPR23                  :1;
    };
    struct {
        unsigned SMT1CPR16              :1;
        unsigned SMT1CPR17              :1;
        unsigned SMT1CPR18              :1;
        unsigned SMT1CPR19              :1;
        unsigned SMT1CPR20              :1;
        unsigned SMT1CPR21              :1;
        unsigned SMT1CPR22              :1;
        unsigned SMT1CPR23              :1;
    };
    struct {
        unsigned SMT1CPR                :8;
    };
} SMT1CPRUbits_t;
