MikroElektronika/core_packages/PIC/XC8/def/PIC16F19186/mcu.h
extern volatile RF6PPSbits_t RF6PPSbits __at(0x1E3E);
// bitfield macros
#define _RF6PPS_RF6PPS0_POSN                                0x0
#define _RF6PPS_RF6PPS0_POSITION                            0x0
#define _RF6PPS_RF6PPS0_SIZE                                0x1
#define _RF6PPS_RF6PPS0_LENGTH                              0x1
#define _RF6PPS_RF6PPS0_MASK                                0x1
#define _RF6PPS_RF6PPS1_POSN                                0x1
#define _RF6PPS_RF6PPS1_POSITION                            0x1
#define _RF6PPS_RF6PPS1_SIZE                                0x1
#define _RF6PPS_RF6PPS1_LENGTH                              0x1
#define _RF6PPS_RF6PPS1_MASK                                0x2
#define _RF6PPS_RF6PPS2_POSN                                0x2
#define _RF6PPS_RF6PPS2_POSITION                            0x2
#define _RF6PPS_RF6PPS2_SIZE                                0x1
#define _RF6PPS_RF6PPS2_LENGTH                              0x1
#define _RF6PPS_RF6PPS2_MASK                                0x4
#define _RF6PPS_RF6PPS3_POSN                                0x3
#define _RF6PPS_RF6PPS3_POSITION                            0x3
#define _RF6PPS_RF6PPS3_SIZE                                0x1
#define _RF6PPS_RF6PPS3_LENGTH                              0x1
#define _RF6PPS_RF6PPS3_MASK                                0x8
#define _RF6PPS_RF6PPS4_POSN                                0x4
#define _RF6PPS_RF6PPS4_POSITION                            0x4
#define _RF6PPS_RF6PPS4_SIZE                                0x1
#define _RF6PPS_RF6PPS4_LENGTH                              0x1
#define _RF6PPS_RF6PPS4_MASK                                0x10
#define _RF6PPS_RF6PPS5_POSN                                0x5
#define _RF6PPS_RF6PPS5_POSITION                            0x5
#define _RF6PPS_RF6PPS5_SIZE                                0x1
#define _RF6PPS_RF6PPS5_LENGTH                              0x1
#define _RF6PPS_RF6PPS5_MASK                                0x20

// Register: RF7PPS
#define RF7PPS RF7PPS
extern volatile unsigned char           RF7PPS              __at(0x1E3F);
#ifndef _LIB_BUILD
asm("RF7PPS equ 01E3Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RF7PPS0                :1;
        unsigned RF7PPS1                :1;
        unsigned RF7PPS2                :1;
        unsigned RF7PPS3                :1;
        unsigned RF7PPS4                :1;
        unsigned RF7PPS5                :1;
    };
} RF7PPSbits_t;
extern volatile RF7PPSbits_t RF7PPSbits __at(0x1E3F);
// bitfield macros
#define _RF7PPS_RF7PPS0_POSN                                0x0
#define _RF7PPS_RF7PPS0_POSITION                            0x0
#define _RF7PPS_RF7PPS0_SIZE                                0x1
#define _RF7PPS_RF7PPS0_LENGTH                              0x1
#define _RF7PPS_RF7PPS0_MASK                                0x1
#define _RF7PPS_RF7PPS1_POSN                                0x1
#define _RF7PPS_RF7PPS1_POSITION                            0x1
#define _RF7PPS_RF7PPS1_SIZE                                0x1
#define _RF7PPS_RF7PPS1_LENGTH                              0x1
#define _RF7PPS_RF7PPS1_MASK                                0x2
#define _RF7PPS_RF7PPS2_POSN                                0x2
#define _RF7PPS_RF7PPS2_POSITION                            0x2
#define _RF7PPS_RF7PPS2_SIZE                                0x1
#define _RF7PPS_RF7PPS2_LENGTH                              0x1
#define _RF7PPS_RF7PPS2_MASK                                0x4
#define _RF7PPS_RF7PPS3_POSN                                0x3
#define _RF7PPS_RF7PPS3_POSITION                            0x3
#define _RF7PPS_RF7PPS3_SIZE                                0x1
#define _RF7PPS_RF7PPS3_LENGTH                              0x1
#define _RF7PPS_RF7PPS3_MASK                                0x8
#define _RF7PPS_RF7PPS4_POSN                                0x4
#define _RF7PPS_RF7PPS4_POSITION                            0x4
#define _RF7PPS_RF7PPS4_SIZE                                0x1
#define _RF7PPS_RF7PPS4_LENGTH                              0x1
#define _RF7PPS_RF7PPS4_MASK                                0x10
#define _RF7PPS_RF7PPS5_POSN                                0x5
#define _RF7PPS_RF7PPS5_POSITION                            0x5
#define _RF7PPS_RF7PPS5_SIZE                                0x1
#define _RF7PPS_RF7PPS5_LENGTH                              0x1
#define _RF7PPS_RF7PPS5_MASK                                0x20

// Register: ANSELF
#define ANSELF ANSELF
extern volatile unsigned char           ANSELF              __at(0x1E50);
#ifndef _LIB_BUILD
asm("ANSELF equ 01E50h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSF0                  :1;
        unsigned ANSF1                  :1;
        unsigned ANSF2                  :1;
        unsigned ANSF3                  :1;
        unsigned ANSF4                  :1;
        unsigned ANSF5                  :1;
        unsigned ANSF6                  :1;
        unsigned ANSF7                  :1;
    };
} ANSELFbits_t;
extern volatile ANSELFbits_t ANSELFbits __at(0x1E50);
// bitfield macros
#define _ANSELF_ANSF0_POSN                                  0x0
#define _ANSELF_ANSF0_POSITION                              0x0
#define _ANSELF_ANSF0_SIZE                                  0x1
#define _ANSELF_ANSF0_LENGTH                                0x1
#define _ANSELF_ANSF0_MASK                                  0x1
#define _ANSELF_ANSF1_POSN                                  0x1
#define _ANSELF_ANSF1_POSITION                              0x1
#define _ANSELF_ANSF1_SIZE                                  0x1
#define _ANSELF_ANSF1_LENGTH                                0x1
#define _ANSELF_ANSF1_MASK                                  0x2
#define _ANSELF_ANSF2_POSN                                  0x2
#define _ANSELF_ANSF2_POSITION                              0x2
#define _ANSELF_ANSF2_SIZE                                  0x1
#define _ANSELF_ANSF2_LENGTH                                0x1
#define _ANSELF_ANSF2_MASK                                  0x4
#define _ANSELF_ANSF3_POSN                                  0x3
#define _ANSELF_ANSF3_POSITION                              0x3
#define _ANSELF_ANSF3_SIZE                                  0x1
#define _ANSELF_ANSF3_LENGTH                                0x1
#define _ANSELF_ANSF3_MASK                                  0x8
#define _ANSELF_ANSF4_POSN                                  0x4
#define _ANSELF_ANSF4_POSITION                              0x4
#define _ANSELF_ANSF4_SIZE                                  0x1
#define _ANSELF_ANSF4_LENGTH                                0x1
#define _ANSELF_ANSF4_MASK                                  0x10
#define _ANSELF_ANSF5_POSN                                  0x5
#define _ANSELF_ANSF5_POSITION                              0x5
#define _ANSELF_ANSF5_SIZE                                  0x1
#define _ANSELF_ANSF5_LENGTH                                0x1
#define _ANSELF_ANSF5_MASK                                  0x20
#define _ANSELF_ANSF6_POSN                                  0x6
#define _ANSELF_ANSF6_POSITION                              0x6
#define _ANSELF_ANSF6_SIZE                                  0x1
#define _ANSELF_ANSF6_LENGTH                                0x1
#define _ANSELF_ANSF6_MASK                                  0x40
#define _ANSELF_ANSF7_POSN                                  0x7
#define _ANSELF_ANSF7_POSITION                              0x7
#define _ANSELF_ANSF7_SIZE                                  0x1
#define _ANSELF_ANSF7_LENGTH                                0x1
#define _ANSELF_ANSF7_MASK                                  0x80

// Register: WPUF
#define WPUF WPUF
extern volatile unsigned char           WPUF                __at(0x1E51);
#ifndef _LIB_BUILD
asm("WPUF equ 01E51h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WPUF0                  :1;
        unsigned WPUF1                  :1;
        unsigned WPUF2                  :1;
        unsigned WPUF3                  :1;
        unsigned WPUF4                  :1;
        unsigned WPUF5                  :1;
        unsigned WPUF6                  :1;
        unsigned WPUF7                  :1;
    };
} WPUFbits_t;
extern volatile WPUFbits_t WPUFbits __at(0x1E51);
// bitfield macros
#define _WPUF_WPUF0_POSN                                    0x0
#define _WPUF_WPUF0_POSITION                                0x0
#define _WPUF_WPUF0_SIZE                                    0x1
#define _WPUF_WPUF0_LENGTH                                  0x1
#define _WPUF_WPUF0_MASK                                    0x1
#define _WPUF_WPUF1_POSN                                    0x1
#define _WPUF_WPUF1_POSITION                                0x1
#define _WPUF_WPUF1_SIZE                                    0x1
#define _WPUF_WPUF1_LENGTH                                  0x1
#define _WPUF_WPUF1_MASK                                    0x2
#define _WPUF_WPUF2_POSN                                    0x2
#define _WPUF_WPUF2_POSITION                                0x2
#define _WPUF_WPUF2_SIZE                                    0x1
#define _WPUF_WPUF2_LENGTH                                  0x1
#define _WPUF_WPUF2_MASK                                    0x4
#define _WPUF_WPUF3_POSN                                    0x3
#define _WPUF_WPUF3_POSITION                                0x3
#define _WPUF_WPUF3_SIZE                                    0x1
#define _WPUF_WPUF3_LENGTH                                  0x1
#define _WPUF_WPUF3_MASK                                    0x8
#define _WPUF_WPUF4_POSN                                    0x4
#define _WPUF_WPUF4_POSITION                                0x4
#define _WPUF_WPUF4_SIZE                                    0x1
#define _WPUF_WPUF4_LENGTH                                  0x1
#define _WPUF_WPUF4_MASK                                    0x10
#define _WPUF_WPUF5_POSN                                    0x5
#define _WPUF_WPUF5_POSITION                                0x5
#define _WPUF_WPUF5_SIZE                                    0x1
#define _WPUF_WPUF5_LENGTH                                  0x1
#define _WPUF_WPUF5_MASK                                    0x20
#define _WPUF_WPUF6_POSN                                    0x6
#define _WPUF_WPUF6_POSITION                                0x6
#define _WPUF_WPUF6_SIZE                                    0x1
#define _WPUF_WPUF6_LENGTH                                  0x1
#define _WPUF_WPUF6_MASK                                    0x40
#define _WPUF_WPUF7_POSN                                    0x7
#define _WPUF_WPUF7_POSITION                                0x7
#define _WPUF_WPUF7_SIZE                                    0x1
#define _WPUF_WPUF7_LENGTH                                  0x1
#define _WPUF_WPUF7_MASK                                    0x80

